docs/spec/html/open-questions.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0000009">1. Open Questions</a>
<ul>
<li><a href="#org0000000">1.1. ストレージ</a></li>
<li><a href="#org0000001">1.2. 実行モデル</a></li>
<li><a href="#org0000002">1.3. 失敗時の状態</a></li>
<li><a href="#org0000003">1.4. 同一URLの扱い（差分/集約）</a></li>
<li><a href="#org0000004">1.5. Signals / Issues</a></li>
<li><a href="#org0000005">1.6. 意図ラベル（Topic）</a></li>
<li><a href="#org0000006">1.7. 表示（タイトル短縮）</a></li>
<li><a href="#org0000007">1.8. UIの形</a></li>
<li><a href="#org0000008">1.9. Shelves / Recall（匂わせ）</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org0000009" class="outline-2">
<h2 id="org0000009"><span class="section-number-2">1.</span> Open Questions</h2>
<div class="outline-text-2" id="text-1">
<p>
MVP実装に入る前に、確定が必要な論点。
</p>
</div>

<div id="outline-container-org0000000" class="outline-3">
<h3 id="org0000000"><span class="section-number-3">1.1.</span> ストレージ</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>SQLite採用は決定済み（decisions.org参照）</li>
<li>データの暗号化要否（ローカル前提でも）</li>
<li>バックアップ/移行の方針</li>
<li>本文（article_text）は永続化する（decisions.org参照）
<ul class="org-ul">
<li>サイズ上限/圧縮/保持期間/削除の扱い</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org0000001" class="outline-3">
<h3 id="org0000001"><span class="section-number-3">1.2.</span> 実行モデル</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>手動実行は決定済み（decisions.org参照）</li>
<li>将来、自動実行（cron/queue）を導入するか</li>
</ul>
</div>
</div>

<div id="outline-container-org0000002" class="outline-3">
<h3 id="org0000002"><span class="section-number-3">1.3.</span> 失敗時の状態</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>リトライ回数/間隔、エラーの保持期間</li>
</ul>
</div>
</div>

<div id="outline-container-org0000003" class="outline-3">
<h3 id="org0000003"><span class="section-number-3">1.4.</span> 同一URLの扱い（差分/集約）</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>同一URLの複数Contentをグルーピングするか（canonical URL / 正規化）</li>
<li>差分（Diff）を取って「差分だけ保存」するか、常に全文スナップショットを保存するか</li>
<li>差分を取る場合の基準（本文ハッシュ、タイトル、セクション単位など）</li>
</ul>
</div>
</div>

<div id="outline-container-org0000004" class="outline-3">
<h3 id="org0000004"><span class="section-number-3">1.5.</span> Signals / Issues</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>`has_signal_*` はTopicの候補フラグとして扱うが、「成立」（ユーザー文脈との一致/承認）をどこでどう扱うか</li>
<li>Issue/Signalの判定根拠（reason）を保存するか（保存するなら形式: TEXT/JSON）</li>
<li>「空ではないが本文として無効」な取得結果（例: ローディング画面、Cloudflare待機、ログイン誘導のみ）はMVPでは扱わない（再取得で運用）</li>
</ul>
</div>
</div>

<div id="outline-container-org0000005" class="outline-3">
<h3 id="org0000005"><span class="section-number-3">1.6.</span> 意図ラベル（Topic）</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>MVPのデフォルト（assumed）:
<ul class="org-ul">
<li>自由記述</li>
<li>1 Topicに複数ラベル可（topic-labeling.org参照）</li>
</ul></li>
<li>固定語彙（プリセット）を導入するか</li>
<li>ラベルの入力タイミング（Scoped Reveal中のみ等）と、想起/匂わせへの反映方法</li>
</ul>
</div>
</div>

<div id="outline-container-org0000006" class="outline-3">
<h3 id="org0000006"><span class="section-number-3">1.7.</span> 表示（タイトル短縮）</h3>
<div class="outline-text-3" id="text-1-7">
<ul class="org-ul">
<li>閾値（文字数）は40文字に決定済み（decisions.org参照）</li>
<li>「30文字」の数え方（Unicode code point / grapheme cluster など）</li>
</ul>
</div>
</div>

<div id="outline-container-org0000007" class="outline-3">
<h3 id="org0000007"><span class="section-number-3">1.8.</span> UIの形</h3>
<div class="outline-text-3" id="text-1-8">
<ul class="org-ul">
<li>MVPはCLI（`ingest_url`）を前提にする（cli.org参照）</li>
<li>S2の「匂わせ」の具体表現（棚一覧の最小情報）</li>
</ul>
</div>
</div>

<div id="outline-container-org0000008" class="outline-3">
<h3 id="org0000008"><span class="section-number-3">1.9.</span> Shelves / Recall（匂わせ）</h3>
<div class="outline-text-3" id="text-1-9">
<ul class="org-ul">
<li>MVPではhost棚（url_host）で開始する（shelves.org）。Topic棚を導入するタイミング</li>
<li>Shelfの表示順（時刻降順のタイブレークなど）をどう統一するか</li>
<li>Recall（定期提示）を導入するか（週次など）。導入するなら頻度と表現</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
